<?php 
//****************************************************************//
//****************************************************************//
//** ชื่อไฟล์ : logout.php 
//** คำอธิบาย : ไฟล์นี้เป็น logout
//** Version : 1.0
//** CoddingDate : 13/08/2556
//** Credit : นัฐวุฒิ เผือกทอง 
//****************************************************************//
//****************************************************************//

session_start();
	include_once("../class/User.php");
		$user = new User();
		$user->logout();
		header("location: ../index.php");
?>