//*****************************************************************************************//
//*****************************************************************************************//
//*** ชื่อไฟล์ : showPage.js
//*** คำอธิบาย : เป็นไฟล์ javascript ใช้สำหรับแสดงหน้าแต่ละเมนู
//*** Version : 1.0
//*** Credit By : นายนัฐวุฒิ  เผือกทอง
//*****************************************************************************************//
//*****************************************************************************************//

//*****************************************************************************************//
//*** เป็นชุด Function ที่ใช้ในการ แสดงหน้าหลัก
//*****************************************************************************************//	
function showMainPage()  
{
	$('#main').load('manageMain.php');
	getTableMain(0);
}

//*****************************************************************************************//
//*** เป็นชุด Function ที่ใช้ในการ แสดงหน้าจัดการผู้ใช้งานระบบ
//*****************************************************************************************//	
function showManageUser()  
{
	
	$('#main').load('manageUser.php');
	getTableUser();
} 

//*****************************************************************************************//
//*** เป็นชุด Function ที่ใช้ในการ แสดงหน้าจัดการประเภท
//*****************************************************************************************//	
function showManageType()  
{
	$('#main').load('manageType.php');
	$('#searchType').autocomplete({minLength: 2});
	getTableType();
	
} 

//*****************************************************************************************//
//*** เป็นชุด Function ที่ใช้ในการ แสดงหน้าจัดการหมวด
//*****************************************************************************************//	
function showManageGroup()  
{
	$('#main').load('manageGroup.php');
	getListType();
	getTableGroup();
	
} 

//*****************************************************************************************//
//*** เป็นชุด Function ที่ใช้ในการ แสดงหน้าจัดการครุภัณฑ์
//*****************************************************************************************//	
function showManageAsset()  
{
	$('#main').load('manageAsset.php');
	$('#searchAsset').autocomplete({source: "../request/reqSelSearch.php",minLength: 2});
	getTableAsset();
	getListYear();
	getListTypeG();
	
} 

//*****************************************************************************************//
//*** เป็นชุด Function ที่ใช้ในการ แสดงหน้าตรวจเช็ค
//*****************************************************************************************//	
function showCheckAsset()  
{
	$('#main').load('checkAsset.php');
	getListYearCheck();
	getTableCheck();
	
}  

//*****************************************************************************************//
//*** เป็นชุด Function ที่ใช้ในการ แสดงหน้าพิมพ์รายงาน
//*****************************************************************************************//	
function showPrintReport()  
{
	$('#main').load('printReport.php');
	getListyearPrint();
	getListMenuQR();
	
}

//*****************************************************************************************//
//*** เป็นชุด Function ที่ใช้ในการ LogOut
//*****************************************************************************************//	
function logOut()  
{
	$('#main').html('<?php $user->logout(); ?>');
	
}
