<?php
//****************************************************************//
//****************************************************************//
//** ชื่อไฟล์ : reqDelUser.php 
//** คำอธิบาย : ไฟล์นี้ เป็นไฟล์ลบข้อมูลผู้ใช้
//** Version : 1.0
//** CoddingDate : 13/08/2556
//** Credit : นัฐวุฒิ เผือกทอง 
//****************************************************************//
//****************************************************************//

		//*************** Check Session ****************
		session_start();
	
		include_once("../class/User.php");
		$user = new User();
		
		if (!$user->getSession())
		{
		   header("location: ../page/main.php");
		}
		//**********************************************
		include_once("../class/User.php");
		$delUser = new User();
		
		$userId = $_GET["userId"];
		
			$delUser->setUserId($userId);
			$delUser->delUser();
		
		
		
?>
